Repository: mathetos/synced-pattern-popups
Catalog: languages/synced-pattern-popups-*.po
Languages: de_de

source: Synced Pattern Popups
de_de: Synchronisierte Muster-Popups

source: A lightweight modal popup system that loads WordPress Synced Pattern content on demand. Trigger with class "spp-trigger-{id}".
de_de: Ein leichtgewichtiges Modal-Popup-System, das WordPress-Synchronisierte-Muster-Inhalte bei Bedarf lädt. Auslösen mit der Klasse "spp-trigger-{id}".

source: Abilities for managing popup content from Synced Patterns.
de_de: Fähigkeiten zum Verwalten von Popup-Inhalten aus synchronisierten Mustern.

source: Render Popup Content
de_de: Popup-Inhalt rendern

source: Renders a synced pattern as popup content with all required styles and assets.
de_de: Rendert ein synchronisiertes Muster als Popup-Inhalt mit allen erforderlichen Styles und Assets.

source: The ID of the synced pattern to render.
de_de: Die ID des zu rendernden synchronisierten Musters.

source: Rendered HTML content.
de_de: Gerenderter HTML-Inhalt.

source: Pattern title.
de_de: Muster-Titel.

source: Array of style handles required for this pattern.
de_de: Array von Style-Handles, die für dieses Muster erforderlich sind.

source: Block supports CSS from Style Engine.
de_de: Block unterstützt CSS vom Style Engine.

source: Block style variation CSS (is-style-* classes).
de_de: Block-Style-Variations-CSS (is-style-* Klassen).

source: Global stylesheet for CSS variables.
de_de: Globales Stylesheet für CSS-Variablen.

source: Detailed asset data (styles and scripts with URLs and inline content).
de_de: Detaillierte Asset-Daten (Styles und Skripte mit URLs und Inline-Inhalten).

source: Invalid pattern ID.
de_de: Ungültige Muster-ID.

source: Pattern ID out of valid range.
de_de: Muster-ID außerhalb des gültigen Bereichs.

source: Pattern not found.
de_de: Muster nicht gefunden.

source: Failed to render pattern content.
de_de: Rendern des Muster-Inhalts fehlgeschlagen.

source: (no title)
de_de: (kein Titel)

source: List Synced Patterns
de_de: Synchronisierte Muster auflisten

source: Returns a list of all synced patterns available for popups.
de_de: Gibt eine Liste aller für Popups verfügbaren synchronisierten Muster zurück.

source: Filter by post status (e.g., "publish", "draft"). Optional.
de_de: Nach Beitragsstatus filtern (z. B. "publish", "draft"). Optional.

source: Array of synced pattern objects.
de_de: Array von synchronisierten Muster-Objekten.

source: Clear Pattern Cache
de_de: Muster-Cache leeren

source: Clears the cached content for a specific synced pattern.
de_de: Löscht den gecachten Inhalt für ein bestimmtes synchronisiertes Muster.

source: The ID of the pattern to clear cache for.
de_de: Die ID des Musters, für das der Cache geleert werden soll.

source: Whether the cache was successfully cleared.
de_de: Ob der Cache erfolgreich geleert wurde.

source: Clear All Popup Cache
de_de: Alle Popup-Caches leeren

source: Clears all cached popup content for all synced patterns.
de_de: Löscht alle gecachten Popup-Inhalte für alle synchronisierten Muster.

source: Number of cache entries deleted.
de_de: Anzahl der gelöschten Cache-Einträge.

source: Scan for Popup Triggers
de_de: Nach Popup-Auslösern suchen

source: Scans HTML content or a post/page for popup trigger links and classes.
de_de: Durchsucht HTML-Inhalte oder einen Beitrag/Seite nach Popup-Auslöser-Links und -Klassen.

source: Post ID to scan. Mutually exclusive with html parameter.
de_de: Zu durchsuchende Beitrags-ID. Gegenseitig ausschließend mit dem html-Parameter.

source: Raw HTML content to scan. Mutually exclusive with post_id parameter.
de_de: Roher HTML-Inhalt zum Durchsuchen. Gegenseitig ausschließend mit dem post_id-Parameter.

source: Array of discovered trigger objects.
de_de: Array von gefundenen Auslöser-Objekten.

source: Trigger type: "class" or "href".
de_de: Auslöser-Typ: "class" oder "href".

source: Optional max-width in pixels.
de_de: Optionale maximale Breite in Pixeln.

source: Post not found.
de_de: Beitrag nicht gefunden.

source: Either post_id or html parameter is required.
de_de: Entweder post_id oder html-Parameter ist erforderlich.

source: Synced Patterns
de_de: Synchronisierte Muster

source: Copied!
de_de: Kopiert!

source: Failed to copy
de_de: Kopieren fehlgeschlagen

source: Pattern deleted successfully.
de_de: Muster erfolgreich gelöscht.

source: Cache cleared successfully. %d entry deleted.
de_de: Cache erfolgreich geleert. %d Eintrag gelöscht.

source: Add New
de_de: Neu hinzufügen

source: Clear Transient Cache
de_de: Transient-Cache leeren

source: Manage synced patterns that can be used as popups. Only synced patterns are available for popup triggers.
de_de: Verwalten Sie synchronisierte Muster, die als Popups verwendet werden können. Nur synchronisierte Muster sind für Popup-Auslöser verfügbar.

source: No synced patterns found.
de_de: Keine synchronisierten Muster gefunden.

source: Create your first synced pattern
de_de: Erstellen Sie Ihr erstes synchronisiertes Muster

source: Title
de_de: Titel

source: Sync Status
de_de: Synchronisierungsstatus

source: Trigger Code
de_de: Auslöser-Code

source: Actions
de_de: Aktionen

source: Synced
de_de: Synchronisiert

source: Unsynced
de_de: Nicht synchronisiert

source: Edit
de_de: Bearbeiten

source: Are you sure you want to delete this pattern?
de_de: Sind Sie sicher, dass Sie dieses Muster löschen möchten?

source: Delete
de_de: Löschen

source: Copy Trigger
de_de: Auslöser kopieren

source: How to use:
de_de: Verwendung:

source: Method 1 - Class name:
de_de: Methode 1 - Klassenname:

source: Method 2 - Href attribute (for Block Editor):
de_de: Methode 2 - Href-Attribut (für Block-Editor):

source: Synced Pattern Popup Support
de_de: Unterstützung für synchronisierte Muster-Popups

source: Default
de_de: Standard

source: Forced On
de_de: Erzwungen aktiviert

source: In most cases you can leave this on Default. Use Forced On if your trigger link/class is injected dynamically (e.g., forms, AJAX, page builders) and the popup assets aren't loading.
de_de: In den meisten Fällen können Sie dies auf Standard belassen. Verwenden Sie "Erzwungen aktiviert", wenn Ihr Auslöser-Link/Klasse dynamisch eingefügt wird (z. B. Formulare, AJAX, Page Builder) und die Popup-Assets nicht geladen werden.

source: Too many requests. Please try again later.
de_de: Zu viele Anfragen. Bitte versuchen Sie es später erneut.

source: Invalid security token. Please refresh the page and try again.
de_de: Ungültiges Sicherheitstoken. Bitte aktualisieren Sie die Seite und versuchen Sie es erneut.

source: Invalid request.
de_de: Ungültige Anfrage.

source: Content not available.
de_de: Inhalt nicht verfügbar.

source: Loading content...
de_de: Inhalt wird geladen...

source: Error loading content. Please try again.
de_de: Fehler beim Laden des Inhalts. Bitte versuchen Sie es erneut.

source: Content not found.
de_de: Inhalt nicht gefunden.

source: Press Escape to close. Tab stays within the popup.
de_de: Drücken Sie Escape zum Schließen. Tab bleibt im Popup.

source: Close modal
de_de: Modal schließen

source: Close
de_de: Schließen
